// 1 встановлюємо aнгулар, відкриваємо проект, і в терміналі запускаєм: ng s --o;
// 2 @Component({
//   selector: 'app-root',
//   templateUrl: './app.component.html',
//   styleUrls: ['./app.component.css']
// }) где @Component - называется декоратор.
//     селектор означает как вызов компонета характерезуется (як можна викликати компонент)
//      templateUrl: - це html. якщо не має окр.файла html, видаляємо Url і template: пишемо прямо розмітку
//      styleUrls: - це css - забираємо Url і в styles: пишем стилі
// 3 якщо добавляємо папку с компонентами, то алт+инстерт створюємо Angular Schematic щоб створились всі файли автоматично -
//   вибираємо create an Angular component или тоже сделать через командну строку в консольке
// 4 обов"язково перевірити чи в модуль компонент тс підключена компонента інакше помилка
// 5 щоб зробити запит в ангуляр є вбудований спец модуль треба HttpClientModule- прописуємв   - imports: [BrowserModul, HttpClientModule ],
// 6 щоб створити запит правильно створюємо сервис, переходимо в  Schematic і називаємо
// 7 переходим в ап модуль і задекларуєм юзер-сервіс
// 8 в юзер-сервіс в конструкторі прописуємо HttpClientModule
// 9 юзер сервіс впроваджуємо метод get і добавляємо посилання.
// 10 створюємо моделс і файл тс де прописуємо інтерфейс
// 11 в юзерс html ітеруємо вивід через *ngFor

// ______
// оптимізуєм юзер компонент
// 12 в папці компонент створюємо Angular Schematic юзер, і створилась нова компонента з реєстрацією в апп модуль
// 13 сегмент з юзерс-ком-нт.html переносимо в юзер-ком-нт.html без ітерації
//    і в файл кзер-ком-нт.ts в експорті вказуємо що юзер відноситься до user: User;
//       щоб не валила помилка з гугл шукаємо по angular property has no initializer і на сайті https://stackoverflow.com/questions/49699067/property-has-no-initializer-and-is-not-definitely-assigned-in-the-construc
//       знаходимо ("strictPropertyInitialization": false)  копіюємо і в становлюємо в tsconfig.json в розділ "compilerOptions":
// 14 а в аппюзерс-ком-нт html викликаємо апп.юзер та ітеруємо
//      і тепер найскладніше як передати ітерацію (тимчасовий об"єкт юзер) в експорт юзер-ком-нт.ts
// 15 в експорт юзер-ком-нт.ts прописуємо спец декоратор: @Input()

